In [1]:
2 + 2

4

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.563614 -0.329498 -2.109620 -0.832064
B  0.439073 -2.017416 -0.091666 -1.446877
C  1.564988  2.053313  0.155399 -0.232573
D -1.523819 -0.718567 -0.243841  1.585095
E  0.160571  0.115993  0.425760 -0.022770

In [5]:
randn(198,722)

array([[ 1.46360684, -0.18166683, -1.27972671, ..., -0.09030109,
        -0.72343503, -1.36400504],
       [ 0.47641478, -0.04054289,  0.30574351, ...,  0.60407639,
         0.21669816, -1.63015561],
       [-1.0773866 , -1.46645838, -0.13514368, ..., -1.09082586,
        -2.30316639, -0.47335028],
       ...,
       [ 0.22380769, -0.63497743, -1.73211591, ..., -0.56807057,
        -0.54880217, -0.42941299],
       [ 0.73500091,  0.86906372, -0.30356169, ..., -0.86744502,
        -0.71506344,  0.20748263],
       [-0.44234151,  0.6634897 ,  0.78862391, ...,  2.16031523,
         2.21507075, -0.46026738]])

In [6]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [10]:
df

          W         X         Y         Z
A -0.563614 -0.329498 -2.109620 -0.832064
B  0.439073 -2.017416 -0.091666 -1.446877
C  1.564988  2.053313  0.155399 -0.232573
D -1.523819 -0.718567 -0.243841  1.585095
E  0.160571  0.115993  0.425760 -0.022770

In [14]:
df[['W','Z']]

          W         Z
A -0.563614 -0.832064
B  0.439073 -1.446877
C  1.564988 -0.232573
D -1.523819  1.585095
E  0.160571 -0.022770

In [15]:
df.W

A   -0.563614
B    0.439073
C    1.564988
D   -1.523819
E    0.160571
Name: W, dtype: float64

In [17]:
df['W']

A   -0.563614
B    0.439073
C    1.564988
D   -1.523819
E    0.160571
Name: W, dtype: float64

In [18]:
type(df["W"])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df['Q'] = df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       new         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660 -1.767660
E  0.160571  0.115993  0.425760 -0.022770  0.586330  0.586330

# for adding

In [24]:
df.drop('new', axis=1)

          W         X         Y         Z         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660
E  0.160571  0.115993  0.425760 -0.022770  0.586330

In [25]:
df

          W         X         Y         Z       new         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660 -1.767660
E  0.160571  0.115993  0.425760 -0.022770  0.586330  0.586330

In [26]:
df.drop('new', axis=1, inplace=True)

In [27]:
df

          W         X         Y         Z         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660
E  0.160571  0.115993  0.425760 -0.022770  0.586330

# for deleting

In [30]:
df.drop('E', axis=0)

          W         X         Y         Z         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660

In [31]:
df

          W         X         Y         Z         Q
A -0.563614 -0.329498 -2.109620 -0.832064 -2.673234
B  0.439073 -2.017416 -0.091666 -1.446877  0.347407
C  1.564988  2.053313  0.155399 -0.232573  1.720387
D -1.523819 -0.718567 -0.243841  1.585095 -1.767660
E  0.160571  0.115993  0.425760 -0.022770  0.586330